youtube-backend/app/controllers/api/v1/users_controller.rb

SELECT  "users".* FROM "users" WHERE (-1) LIMIT $1  [["LIMIT", 1]]
INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "rich"], ["password", "pw"], ["created_at", "2018-10-23 17:50:26.282082"], ["updated_at", "2018-10-23 17:50:26.282082"]]
---
  def signup
    @user = User.find_by(user_params)

    if @user
      @user = {username: "", password: ""}
    else
      @user = User.create!(user_params)