youtube-backend/app/controllers/api/v1/videos_controller.rb

  def like
    @video = Video.find_or_create_by(video_params)
    @favorite_params = favorite_params
    @favorite_params[:video_id] = @video.id
    @like = Favorite.find_or_create_by(@favorite_params)
---
INSERT INTO "videos" ("name", "description", "video_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "favorites".* FROM "favorites" WHERE "favorites"."video_id" = $1  [["video_id", 3]]
INSERT INTO "favorites" ("user_id", "video_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["video_id", 3], ["created_at", "2018-10-23 17:04:28.809364"], ["updated_at", "2018-10-23 17:04:28.809364"]]

  def likes
    @video = Video.find_by(video_id: params[:id])

    @likes = {likes: 0}

    if @video
      @likes = {likes: @video.favorites.length}
---
SELECT  "videos".* FROM "videos" WHERE "videos"."video_id" = $1 LIMIT $2  [["video_id", "1"], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."video_id" = $1  [["video_id", 2]]